Repository: cevheri/flutter-bloc-advanced
Catalog: lib/l10n/intl_*.arb
Languages: tr

source: Account
tr: Hesabım

source: Active
tr: Aktif

# approved_status
source: Approved
tr: Teklif Onay

source: Authorities
tr: Yetkiler

# authorities_required
source: Authorities is required
tr: Yetki gereklidir

# birim_numeric
source: birim must be a valid
tr: birim sayısal olmalıdır

# birim_required
source: birim is required
tr: birim gereklidir

source: Calculate
tr: Hesapla

# calculated_maturity_screen
source: Calculated Maturity
tr: Vade Hesaplama

# calculated_status
source: Calculated
tr: Hesaplanan

source: Cancel
tr: İptal

# cancelled_status
source: Cancelled
tr: İptal Edildi

# cari_kod
source: Account Code
tr: Müşteri Kodu

# change_nothing
source: Nothing changed
tr: Değişiklik bulunamadı

source: Change Password
tr: Şifre Değiştir

source: Cities
tr: Şehirler

source: City
tr: Şehir

# city_required
source: City is required
tr: Şehir gereklidir

source: Company Name
tr: Firma ismi

# completed_status
source: Completed
tr: Tamamlandı

# confirm
source: Passwords must match
tr: Onaylandı

# confirm_new
source: Confirm New Password
tr: Şifre değiştirildi

# confirmation_status
source: Confirmation Offers
tr: Teklif Onaylandı

source: Corporation
tr: Dağıtım Firması

# corporation_required
source: Corporation is required
tr: Dağıtım Firması gereklidir

source: Corporations
tr: Ana Firmaları

source: Cost
tr: Maliyet

source: Create
tr: Oluştur

source: Create New Offer
tr: Yeni Teklif Oluştur

source: Create Corporation
tr: Dağıtım Firması Oluştur

source: Create Corporation Maturity
tr: Ana Firma Vade Oluştur

source: Create Offer
tr: Teklif Oluştur

source: Create Refinery
tr: Üretici Oluştur

source: Create Station
tr: Alt Firma Oluştur

source: Create Station Maturity
tr: Alt Firma Vade Oluştur

source: Create User
tr: Kullanıcı Oluştur

source: Credit
tr: Kredi

source: Credit Card
tr: Kredi Kartı

source: Customer
tr: Müşteri

source: Customers
tr: Müşteriler

source: Daily
tr: Günlük

source: Date
tr: Tarih

source: Day
tr: Gün

source: Debt
tr: Borç

source: Delete
tr: Sil

# delete_confirmation
source: Are you sure you want to delete?
tr: Silmek istediğinize emin misiniz?

# description_max_length
source: Description cannot be more than 20 characters long
tr: Açıklama en fazla 20 karakter uzunluğunda olmalıdır

# description_min_length
source: Description must be at least 5 characters long
tr: Açıklama en az 5 karakter uzunluğunda olmalıdır

# description_offer
source: Description
tr: Açıklama

# description_regex_pattern
source: Description must be a valid
tr: Açıklama geçerli değil

# description_required
source: Description is required
tr: Açıklama gereklidir

source: Destination Address
tr: Varış Yeri

source: Destination City
tr: Varış Yeri İl

# destination_city_required
source: Destination City is required
tr: Varış Şehri gereklidir

source: Destination District
tr: Varış Yeri İlçe

source: Detail
tr: Detay

source: District
tr: İlçe

source: Districts
tr: İlçeler

source: Document
tr: Döküman

source: Edit
tr: Düzenle

source: Edit Corporation
tr: Dağıtım Firması Düzenle

source: Edit Corporation Maturity
tr: Dağıtım Şirketi Vade Düzenle

source: Edit Offer
tr: Teklif Düzenle

source: Edit Refinery
tr: Üretici Düzenle

source: Edit Station
tr: Alt Firma Düzenle

source: Edit Station Maturity
tr: Alt Firma Vade Düzenle

source: Edit User
tr: Kullanıcı Düzenle

source: Email
tr: E-posta

# email_error
source: Email address not found
tr: E-posta gönderilemedi

# email_pattern
source: Email must be a valid email address
tr: E-posta adresi geçerli değil

# email_required
source: Email is required
tr: E-posta gereklidir

# email_reset_password_error
source: Email address not found
tr: Şifre sıfırlama e-postası gönderilemedi

# email_reset_password_sending
source: Sending email to reset password...
tr: Şifre sıfırlama e-postası gönderiliyor...

# email_reset_password_success
source: Email sent successfully
tr: Şifre sıfırlama e-postası başarıyla gönderildi

# email_send
source: Send Email
tr: E-posta Gönder

# email_success
source: Email sent successfully
tr: E-posta başarıyla gönderildi

source: English
tr: İngilizce

source: Exit
tr: Çıkış

source: Find
tr: Ara

source: First Name
tr: İsim

# firstname_max_length
source: Firstname cannot be more than 20 characters long
tr: İsim en fazla 20 karakter uzunluğunda olmalıdır

# firstname_min_length
source: Firstname must be at least 5 characters long
tr: İsim en az 5 karakter uzunluğunda olmalıdır

# firstname_required
source: Firstname is required
tr: İsim gereklidir

source: Home
tr: Ana Sayfa

source: Home Page
tr: Anasayfa

source: Increase
tr: Revize

# increase_unit_price
source: Increase Price
tr: Revize Fiyat

# language_select
source: Select Language
tr: Dil Seçimi

source: Last Name
tr: Soyisim

# lastname_max_length
source: Lastname cannot be more than 20 characters long
tr: Soyisim en fazla 20 karakter uzunluğunda olmalıdır

# lastname_min_length
source: Lastname must be at least 5 characters long
tr: Soyisim en az 5 karakter uzunluğunda olmalıdır

# lastname_required
source: Lastname is required
tr: Soyisim gereklidir

source: List
tr: Listele

source: List Offer
tr: Teklifler

source: List Corporation
tr: Ana Firmaları

source: List Offer
tr: Teklifler

source: List Refinery
tr: Üreticiler

source: List Station
tr: Alt Firmalar

source: List User
tr: Kullanıcılar

source: Loading...
tr: Yükleniyor...

source: Logging in...
tr: Giriş yapılıyor...

source: Login
tr: Kullanıcı Adı

# login_button
source: Login
tr: Giriş Yap

# login_error
source: Login failed.
tr: Giriş yapılamadı.

# login_password
source: Password
tr: Şifre

# login_user_name
source: Username
tr: Kullanıcı adı

source: Logout
tr: Çıkış Yap

# logout_sure
source: Are you sure you want to logout?
tr: Çıkış yapmak istediğinize emin misiniz?

source: Maturity
tr: Vade

source: Maturity Type
tr: Vade Tipi

source: Maturity Types
tr: Vade Tipleri

source: Monthly
tr: Aylık

source: Name
tr: İsim

# name_max_length
source: Name cannot be more than 20 characters long
tr: İsim en fazla 20 karakter uzunluğunda olmalıdır

# name_min_length
source: Name must be at least 5 characters long
tr: İsim en az 5 karakter uzunluğunda olmalıdır

# name_regex_pattern
source: Name must be a valid
tr: İsim geçerli değil

# name_required
source: Name is required
tr: İsim gereklidir

source: New Increase
tr: Yeni Bindirim Oranı

source: No
tr: Hayır

source: Offer Form
tr: Teklif Formu

source: Offers
tr: Teklifler

source: Ok
tr: Tamam

# password_forgot
source: Forgot Password
tr: Şifremi unuttum

# password_max_length
source: Password cannot be more than 6 characters long
tr: Şifre en fazla 20 karakter uzunluğunda olmalıdır

# password_min_length
source: Password must be at least 5 characters long
tr: Şifre en az 6 karakter uzunluğunda olmalıdır

# password_required
source: Password is required
tr: Şifre gereklidir

source: Phone Number
tr: Tel No

source: Price
tr: Fiyat

# price_empty
source: Price cannot be empty
tr: Fiyat boş olamaz

# price_max_length
source: Price cannot be more than 10 characters long
tr: Fiyat en fazla 10 karakter uzunluğunda olmalıdır

# price_min_length
source: Price must be at least 1 characters long
tr: Fiyat en az 1 karakter uzunluğunda olmalıdır

# price_regex_pattern
source: Price must be a valid
tr: Fiyat geçerli değil

# price_required
source: Price is required
tr: Fiyat gereklidir

# price_with_vat
source: With Wat Price
tr: Vergi dahil Fiyat

# price_with_vat_empty
source: With Wat Price cannot be empty
tr: Vergi dahil Fiyat boş olamaz

# price_with_vat_max_length
source: With Wat Price cannot be more than 10 characters long
tr: Vergi dahil Fiyat en fazla 10 karakter uzunluğunda olmalıdır

# price_with_vat_min_length
source: With Wat Price must be at least 1 characters long
tr: Vergi dahil Fiyat en az 1 karakter uzunluğunda olmalıdır

# price_with_vat_regex_pattern
source: With Wat Price must be a valid
tr: Vergi dahil Fiyat geçerli değil

# price_with_vat_required
source: With Wat Price is required
tr: Vergi dahil Fiyat gereklidir

source: Range
tr: Aralık

source: Rate
tr: Oran

source: Refineries
tr: Üreticiler

source: Refineries Description
tr: Açıklama

source: Refinery
tr: Üretici

# refinery_required
source: Refinery is required
tr: Üretici gereklidir

# rejected_status
source: Rejected
tr: Reddedilen

source: Reports
tr: Raporlar

# required_cost
source: Cost is required
tr: Maliyet gereklidir

# required_maturity
source: Maturity is required
tr: Vade gereklidir

# required_phone_type
source: Phone Type Required 5** *** ** **
tr: Telefon numarası 5** *** ** ** formatında ve 10 karakter olmalıdır

# required_range
source: Range is required
tr: Aralık gereklidir

# required_rate
source: Rate is required
tr: Oran gereklidir

# required_salesPerson
source: Sales Person is required
tr: Plasiyer gereklidir

source: Role
tr: Rol

source: Sales Person
tr: Plasiyer

source: Sales Person Code
tr: Plasiyer Kodu

source: Save
tr: Kaydet

# screen_size_error
source: Screen size is too small.
tr: Ekran boyutu çok küçük.

source: Select
tr: Seçiniz

source: Select Customer
tr: Müşteri Seçiniz

source: Send
tr: Gönder

source: Send Offer
tr: Teklifi Onaya Gönder

source: Settings
tr: Ayarlar

source: Station
tr: Dolum Tesisi

source: Station Rate
tr: Alt Firmalar Oran

# station_required
source: Station is required
tr: Alt Firma gereklidir

source: Stations
tr: Alt Firmalar

source: Status
tr: Durum

source: Tax Number
tr: Vergi Numarası

source: Theme
tr: Tema

source: Todo List
tr: Yapılacak İşler

source: Total Price
tr: Toplam Fiyat

# translate_menu_title
source: {translate, select, station{Stations} maturityCalculate{Maturity Calculated} stationMaturity{Station Maturity} corporation{Corporations} corporationMaturity{Corporation Maturity} refinery{Refineries} offer{Offers} customer{Customers} salesPerson{Sales Person} account{Account} settings{Settings} dashboard{Dashboard}reports{Reports} logout{Logout} info{Info} language{Language} theme{Theme} create{Create} list{List/Edit} other{Other}}
tr: {translate, select,station{Alt Firmalar} maturityCalculate{Vade Hesaplama} stationMaturity{Alt Firma Vadeleri} corporation{Ana Firmaları} corporationMaturity{Ana Firma Vadeleri} refinery{Üreticiler} offer{Teklifler} customer{Müşteriler} salesPerson{Satış Temsilcisi} account{Hesabım} settings{Ayarlar} dashboard{Grafikler} reports{Raporlar} logout{Çıkış} info{Bilgiler} language{Diller} theme{Tema} create{Oluştur} list{Listele/Düzenle } other{Diğer}}

# translate_status_title
source: {translate, select,selected{All} CALCULATED{Hesaplanan Teklif} APPROVAL_IN_PROGRESS{Teklif Onay} TO_BE_ORDERED{Teklif onaylandı} APPROVAL_REJECTED{Teklif reddedildi} IN_NEGOTIATION{Güncel teklif müşteriye önerildi} ACCEPTED{Güncel teklifi müşteri kabul etti} RESCINDED{Güncel teklifi müşteri red etti} SHIPPED{Tamamlandı} CANCELLED{Teklif geri çekildi ve iptal edildi} DRAFT{Kaydet} APPROVED{Teklif müşteriye gönderilmeye hazır} ORDERED{Sipariş hazırlandı} other{Diğer}}
tr: {translate, select,selected{Tümü} CALCULATED{Hesaplanan Teklif} APPROVAL_IN_PROGRESS{Teklif Onay} TO_BE_ORDERED{Teklif onaylandı} APPROVAL_REJECTED{Teklif reddedildi} IN_NEGOTIATION{Güncel teklif müşteriye önerildi} ACCEPTED{Güncel teklifi müşteri kabul etti} RESCINDED{Güncel teklifi müşteri red etti} SHIPPED{Tamamlandı} CANCELLED{Teklif geri çekildi ve iptal edildi} DRAFT{Kaydet} APPROVED{Teklif müşteriye gönderilmeye hazır} ORDERED{Sipariş hazırlandı} other{Diğer}}

# transport_cost
source: Transport Cost TL
tr: Taşıma Maliyeti TL

# transport_cost_numeric
source: Transport Cost must be a valid
tr: Taşıma Maliyeti sayısal olmalıdır

# transport_cost_required
source: Transport Cost is required
tr: Taşıma Maliyeti gereklidir

# transport_cost_tl
source: Transport
tr: Nakliye

source: Transport Date
tr: Sevk Tarihi

# transport_date_required
source: Transport Date is required
tr: Sevk Tarihi gereklidir

# transport_distance
source: Transport Distance Km
tr: Taşıma Mesafesi Km

# transport_distance_numeric
source: Transport Distance must be a valid
tr: Taşıma Mesafesi sayısal olmalıdır

# transport_distance_required
source: Transport Distance is required
tr: Taşıma Mesafesi gereklidir

source: Turkish
tr: Türkçe

source: Unit Price
tr: Birim Fiyat

# unit_price_update
source: Last Price Update
tr: Son Fiyatı Güncelle

source: Update
tr: Güncelle

source: Update Description
tr: Açıklamayı Güncelle

# username_max_length
source: Username cannot be more than 20 characters long
tr: Kullanıcı adı en fazla 20 karakter uzunluğunda olmalıdır

# username_min_length
source: Username must be at least 5 characters long
tr: Kullanıcı adı en az 5 karakter uzunluğunda olmalıdır

# username_regex_pattern
source: Username must be a valid email address
tr: Kullanıcı adı geçerli değil

# username_required
source: Username is required
tr: Kullanıcı adı gereklidir

source: Users
tr: Kullanıcılar

source: Vat No
tr: Vergi No

source: Weekly
tr: Haftalık

source: Welcome
tr: Hoş geldiniz

source: Yes
tr: Evet

source: Services
tr: Hizmetlerimiz

# services_detail
source: Our company, established in 2024, develops customized systems for factories by integrating advanced technologies such as industrial IoT (Internet of Things), Machine Learning, and Artificial Intelligence. These systems help our customers optimize their production processes, reduce costs, and increase efficiency. Additionally, we further enhance factory operations through our mobile application and web-based solutions.
tr: Firmamız, 2024 yılında kurulmuş olup, endüstriyel IoT (Nesnelerin İnterneti), Makine Öğrenimi ve Yapay Zeka gibi ileri teknolojileri entegre ederek fabrikalar için özelleştirilmiş sistemler geliştirmektedir. Bu sistemler, müşterilerimizin üretim süreçlerini optimize etmelerine, maliyetleri düşürmelerine ve verimliliği artırmalarına yardımcı olmaktadır. Ayrıca, mobil uygulama ve web tabanlı çözümlerimiz aracılığıyla fabrika operasyonlarını daha da iyileştiriyoruz.

source: Products
tr: Ürünlerimiz

# products_detail
source: Our company offers customized software and hardware products for industrial sectors. Among these are IoT devices and sensors that help factories monitor production processes, analyze data, and make decisions. Additionally, we develop software solutions using machine learning algorithms and artificial intelligence technologies to enhance automation and efficiency in factories.
tr: Firmamız, endüstriyel sektörler için özelleştirilmiş yazılım ve donanım ürünleri sunmaktadır. Bunlar arasında, fabrikaların üretim süreçlerini izlemelerine, verileri analiz etmelerine ve karar almalarına yardımcı olan IoT cihazları ve sensörler bulunmaktadır. Ayrıca, makine öğrenimi algoritmaları ve yapay zeka teknolojileri kullanarak fabrikaların otomasyonunu ve verimliliğini artıran yazılım çözümleri geliştiriyoruz.

source: About Us
tr: Hakkımızda

# about_us_detail
source: Established in 2024, our company is a pioneer in industrial transformation, continuously offering innovative solutions to provide our customers with a competitive advantage. With an experienced team and a strong R&D infrastructure, we push the boundaries of industrial IoT, machine learning, and artificial intelligence technologies. Focused on our customers' needs, we aim to deliver scalable, reliable, and user-friendly solutions.
tr: Firmamız, 2024 yılında kurulmuş olup, endüstriyel dönüşümün öncüsü olarak, müşterilerimize rekabet avantajı sağlamak için sürekli olarak yenilikçi çözümler sunmaktadır. Deneyimli bir ekip ve güçlü bir Ar-Ge altyapısıyla, endüstriyel IoT, makine öğrenimi ve yapay zeka teknolojilerinin sınırlarını zorluyoruz. Müşterilerimizin ihtiyaçlarına odaklanarak, ölçeklenebilir, güvenilir ve kullanıcı dostu çözümler sunmayı amaçlıyoruz.

source: FAQ
tr: SSS

source: Our References
tr: Referanslarımız

# our_references_detail
source: Our company provides services to numerous clients from various industries. To learn more about our past projects and customer satisfaction, please feel free to contact us. We would be delighted to provide detailed information regarding the references of the companies we have collaborated with. For communication, please reach out to us at sekoyatech@gmail.com or call us at +905077438321. Our expert team will get in touch with you as soon as possible.
tr: Firmamız, çeşitli endüstrilerden birçok müşteriye hizmet sunmaktadır. Geçmiş projelerimiz ve müşteri memnuniyeti hakkında daha fazla bilgi edinmek için bizimle iletişime geçebilirsiniz. Size, işbirliği yaptığımız firmaların referanslarıyla ilgili detaylı bilgileri sağlamaktan memnuniyet duyarız. İletişim için lütfen sekoyatech@gmail.com üzerinden bize ulaşın veya +905077438321 numaralı telefonu arayın. Uzman ekibimiz, sizinle en kısa sürede iletişime geçecektir.
